app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 105]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 105]]
---
    <div class="middle-profile">
      <p><span id="posts-number"><%= @user.posts.count %></span> posts</p>

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 105]]
---
<div id="post-parent" class="main-profile-posts">
  <% @user.posts.each do |post| %>