app/views/pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 105], ["LIMIT", 1]]
---
                class="post-avatar profile-pic-wrapper"
                style="background-image: url(<%= post.user.avatar if post.user.present? %>)"