app/views/posts/edit.html.erb

                class="post-avatar profile-pic-wrapper"
                style="background-image: url(<%#= post.user.avatar if post.user.present? %>)"
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 113], ["LIMIT", 1]]