app/controllers/pages_controller.rb

  def home
    @posts = Post.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC