app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.sort_by {|post| post.created_at}.reverse!

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @post = Post.find params[:id]

INSERT INTO "posts" ("photo", "location", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["photo", "zqbclobwkgtg3y7nmty8"], ["location", "Home"], ["description", "Sisco"], ["created_at", "2021-10-28 11:40:25.275592"], ["updated_at", "2021-10-28 11:40:25.275592"], ["user_id", 105]]
---
  def create
    post = Post.new post_params
    if params[:post][:photo].present?
      req = Cloudinary::Uploader.upload(params[:post][:photo])
      post.photo = req["public_id"]
      post.user_id = @current_user.id
      post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 92], ["LIMIT", 1]]
---
  def update
    post = Post.find params[:id]