app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    check_for_admin
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 55], ["LIMIT", 1]]
---
  def delete
    if @current_user.admin?
      @user = User.find params[:id]

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 105], ["LIMIT", 1]]
---
  def edit
    if @current_user.admin?
      @user = User.find params[:id]

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new user_params
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 120], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$vgDTBTARyAhp4UQAFnc7V.evIbYUpPw8bC.x/7GHSMyqRqss43YFO"], ["updated_at", "2021-10-29 05:17:45.153405"], ["id", 120]]
---
  def update
    user = User.find params[:id]
    user.update_attributes user_params

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 120], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 120]]
---
  def destroy
    user = User.find params[:id]
    user.destroy